Primero creo el contenedor de MyPostgress: 
```
docker run --name my-postgress -e POSTGRES_PASSWORD=mysecretpassword -p 5432:5432 -d postgres
```

In [7]:
# postgres_example.py
import psycopg2
from psycopg2 import sql

# --- Parámetros de conexión ---
# Asegúrate de que el contenedor Docker esté corriendo
DB_HOST = "localhost"
DB_PORT = "5432"
DB_NAME = "postgres"  # Base de datos por defecto
DB_USER = "postgres"  # Usuario por defecto
DB_PASS = "mysecretpassword" # La que pusiste en el comando docker run

In [8]:
# 1. Establecer la conexión
conn = psycopg2.connect(
    host=DB_HOST,
    port=DB_PORT,
    dbname=DB_NAME,
    user=DB_USER,
    password=DB_PASS
)
print("Conexión a PostgreSQL exitosa!")

Conexión a PostgreSQL exitosa!

In [9]:
# 2. Crear un cursor (autocommit=True para que los cambios se apliquen inmediatamente)
conn.autocommit = True
cursor = conn.cursor()

# 3. Ejecutar queries
# Limpieza previa (opcional)
cursor.execute("DROP TABLE IF EXISTS usuarios;")

# Crear tabla
create_table_query = """
CREATE TABLE usuarios (
    id SERIAL PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    email VARCHAR(50) UNIQUE NOT NULL
);
"""
cursor.execute(create_table_query)
print("Tabla 'usuarios' creada.")

Tabla 'usuarios' creada.

In [10]:
# Insertar datos de forma segura para evitar inyección SQL
insert_query = "INSERT INTO usuarios (nombre, email) VALUES (%s, %s);"
usuarios_a_insertar = [
    ('Ana', 'ana@example.com'),
    ('Carlos', 'carlos@example.com')
]
cursor.executemany(insert_query, usuarios_a_insertar)
print(f"{cursor.rowcount} usuarios insertados.")

# 4. Consultar y obtener resultados
cursor.execute("SELECT id, nombre, email FROM usuarios ORDER BY nombre;")

print("\n--- Usuarios en la base de datos ---")
for row in cursor.fetchall():
    print(f"ID: {row[0]}, Nombre: {row[1]}, Email: {row[2]}")

2 usuarios insertados.

--- Usuarios en la base de datos ---
ID: 1, Nombre: Ana, Email: ana@example.com
ID: 2, Nombre: Carlos, Email: carlos@example.com

In [11]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (2.0.43)
Requirement already satisfied: greenlet>=1 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (3.2.4)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from sqlalchemy) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

SQLALCHEMY permite la conexión de bases de datos con distintos sistemas de gestión de bases de datos

URL GENERICA CONEXION BASE DE DATOS
```
<protocolo>://<usuario>:<contraseña@<host>:<puerto>/<nombre_bd>
```

In [12]:
from sqlalchemy import create_engine

churro = 'postgresql://postgres:mysecretpassword@localhost:5432/postgres'
engine = create_engine(churro)

In [13]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (2.3.2)
Requirement already satisfied: numpy>=1.23.2 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from pandas) (2.3.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [14]:
import pandas as pd
pd.read_sql('SELECT * FROM usuarios;', engine)

   id  nombre               email
0   1     Ana     ana@example.com
1   2  Carlos  carlos@example.com

In [15]:
df = pd.DataFrame(
    {"col1": [1,2,3,4,5],
    "col2": [10,20,30,40,50]}
)

In [16]:
df

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [17]:
df.to_sql(index=False, name='test', con=engine, if_exists='replace')

5

In [18]:
pd.read_sql('SELECT * FROM test;', engine)

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

AHORA CON MYSQL
```

Primero hago el docker run: 
```
docker run --name my-mysql -e MYSQL_ROOT_PASSWORD=mysecretpassword -p 3306:3306 -d mysql
```

In [19]:
pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\jose\miniconda3\envs\sql_env\lib\site-packages (9.4.0)
Note: you may need to restart the kernel to use updated packages.

In [20]:
# mysql_example.py
import mysql.connector
from mysql.connector import errorcode

# --- Parámetros de conexión ---
# Asegúrate de que el contenedor Docker esté corriendo
DB_HOST = "localhost"
DB_PORT = "3306"
DB_USER = "root"
DB_PASS = "mysecretpassword" # La que pusiste en el comando docker run
DB_NAME = "testdb" # Crearemos esta base de datos

In [21]:
# 1. Establecer la conexión (sin especificar la base de datos al principio)
conn = mysql.connector.connect(
    host=DB_HOST,
    port=DB_PORT,
    user=DB_USER,
    password=DB_PASS
)
print("Conexión a MySQL exitosa!")
cursor = conn.cursor()

Conexión a MySQL exitosa!

In [22]:
# Crear la base de datos si no existe
cursor.execute(f"CREATE DATABASE IF NOT EXISTS {DB_NAME} CHARACTER SET 'utf8mb4'")
cursor.execute(f"USE {DB_NAME}")
print(f"Usando la base de datos '{DB_NAME}'.")

Usando la base de datos 'testdb'.

In [23]:
# 3. Ejecutar queries
# Limpieza previa (opcional)
cursor.execute("DROP TABLE IF EXISTS usuarios;")

In [24]:
# Crear tabla
create_table_query = """
CREATE TABLE usuarios (
    id INT AUTO_INCREMENT PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    email VARCHAR(50) UNIQUE NOT NULL
) ENGINE=InnoDB;
"""
cursor.execute(create_table_query)
print("Tabla 'usuarios' creada.")

Tabla 'usuarios' creada.

In [25]:
# Insertar datos
insert_query = "INSERT INTO usuarios (nombre, email) VALUES (%s, %s)"
usuarios_a_insertar = [
    ('Ana', 'ana@example.com'),
    ('Carlos', 'carlos@example.com')
]
cursor.executemany(insert_query, usuarios_a_insertar)
conn.commit() # En mysql-connector, el commit es manual
print(f"{cursor.rowcount} usuarios insertados.")

2 usuarios insertados.

In [26]:
try:
    # 4. Consultar y obtener resultados
    cursor.execute("SELECT id, nombre, email FROM usuarios ORDER BY nombre;")

    print("\n--- Usuarios en la base de datos ---")
    for (id, nombre, email) in cursor:
        print(f"ID: {id}, Nombre: {nombre}, Email: {email}")

except mysql.connector.Error as err:
    if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
        print("Error de usuario o contraseña")
    elif err.errno == errorcode.ER_BAD_DB_ERROR:
        print("La base de datos no existe")
    else:
        print(f"Ocurrió un error de MySQL: {err}")

except Exception as e:
    print(f"Ocurrió un error general: {e}")

--- Usuarios en la base de datos ---
ID: 1, Nombre: Ana, Email: ana@example.com
ID: 2, Nombre: Carlos, Email: carlos@example.com

In [27]:
churro = 'mysql+pymysql://root:mysecretpassword@localhost:5432/testdb'
engine = create_engine(churro)

import pandas as pd

In [28]:
import sqlite3

sqlitedb= "mi_db.db"

churro = "sqlite:///mi_db.db"
engine_sqlite = create_engine(churro)

In [29]:
df.to_sql(index=False, name='new_table', con=engine_sqlite, if_exists='replace')

5

In [31]:
pd.read_sql('SELECT * FROM new_table;', engine_sqlite)
# -*- coding: utf-8 -*-

   col1  col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50